In [39]:
import pandas as pd

In [40]:
data1={"name":["aa","bb","cc","dd","ee"],
      "city":["zanjan","tehran","rasht","shiraz","tabriz"],
      "score":[10,11,12,13,14]}

In [41]:
data1

{'name': ['aa', 'bb', 'cc', 'dd', 'ee'],
 'city': ['zanjan', 'tehran', 'rasht', 'shiraz', 'tabriz'],
 'score': [10, 11, 12, 13, 14]}

In [42]:
data_good=pd.DataFrame(data1)

In [43]:
data_good

  name    city  score
0   aa  zanjan     10
1   bb  tehran     11
2   cc   rasht     12
3   dd  shiraz     13
4   ee  tabriz     14

In [44]:
my_index=["red","yellow","green","blue","purple"]

In [45]:
data_good=pd.DataFrame(data1, index=my_index)

In [46]:
data_good

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11
green    cc   rasht     12
blue     dd  shiraz     13
purple   ee  tabriz     14

In [47]:
data_good.columns

Index(['name', 'city', 'score'], dtype='object')

In [48]:
data_good.index

Index(['red', 'yellow', 'green', 'blue', 'purple'], dtype='object')

In [49]:
type(data_good)

pandas.core.frame.DataFrame

In [50]:
data_good.iloc[0]

name         aa
city     zanjan
score        10
Name: red, dtype: object

In [19]:
data_good.iloc[[0,1]]

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11

In [20]:
data_good.iloc[[0,1],0]

red       aa
yellow    bb
Name: name, dtype: object

In [22]:
data_good.loc["red"]

name         aa
city     zanjan
score        10
Name: red, dtype: object

In [24]:
data_good.loc[["red","yellow"]]

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11

In [26]:
data_good.loc[["red","yellow"],"name"]

red       aa
yellow    bb
Name: name, dtype: object

In [27]:
data_good

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11
green    cc   rasht     12
blue     dd  shiraz     13
purple   ee  tabriz     14

In [9]:
filter1=(data_good["name"]=="aa")  ### select rows with name "aa"

In [40]:
filter1

red        True
yellow    False
green     False
blue      False
purple    False
Name: name, dtype: bool

In [10]:
data_good.loc[filter1]

    name    city  score
red   aa  zanjan     10

In [45]:
data_good[data_good["name"]=="aa"]   ### alternative: select rows with name "aa"

    name    city  score
red   aa  zanjan     10

In [11]:
data_good.loc[filter1,"score"]

red    10
Name: score, dtype: int64

In [12]:
data_good.loc[filter1,["score","name"]]

     score name
red     10   aa

In [13]:
filter2=(data_good["name"]=="aa")&(data_good["city"]=="zanjan")

In [49]:
filter2

red        True
yellow    False
green     False
blue      False
purple    False
dtype: bool

In [14]:
data_good.loc[filter2]

    name    city  score
red   aa  zanjan     10

In [19]:
filter3=(data_good["score"]>12)

In [17]:
filter3

red       False
yellow    False
green     False
blue       True
purple     True
Name: score, dtype: bool

In [20]:
data_good.loc[filter3]

       name    city  score
blue     dd  shiraz     13
purple   ee  tabriz     14

In [57]:
cities=["zanjan","tehran","rasht"]

In [59]:
filter4=data_good["city"].isin(cities)

In [60]:
filter4

red        True
yellow     True
green      True
blue      False
purple    False
Name: city, dtype: bool

In [61]:
data_good.loc[filter4]

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11
green    cc   rasht     12

In [51]:
data_good.columns

Index(['name', 'city', 'score'], dtype='object')

In [52]:
data_good.index

Index(['red', 'yellow', 'green', 'blue', 'purple'], dtype='object')

In [53]:
data_good.columns=["first_name","city_name","score_ID"]

In [54]:
data_good

       first_name city_name  score_ID
red            aa    zanjan        10
yellow         bb    tehran        11
green          cc     rasht        12
blue           dd    shiraz        13
purple         ee    tabriz        14

In [55]:
data_good.columns[1]

'city_name'

In [56]:
data_good

       first_name city_name  score_ID
red            aa    zanjan        10
yellow         bb    tehran        11
green          cc     rasht        12
blue           dd    shiraz        13
purple         ee    tabriz        14

In [57]:
data_good.columns

Index(['first_name', 'city_name', 'score_ID'], dtype='object')

In [58]:
data_good.columns=data_good.columns.str.replace("_","-")

In [59]:
data_good.columns

Index(['first-name', 'city-name', 'score-ID'], dtype='object')

In [60]:
data_good

       first-name city-name  score-ID
red            aa    zanjan        10
yellow         bb    tehran        11
green          cc     rasht        12
blue           dd    shiraz        13
purple         ee    tabriz        14

In [64]:
data_good.columns[1]

'city-name'

In [67]:
data_good.columns=data_good.columns.str.replace("-","_") ### change column names for all columns

In [68]:
data_good.columns

Index(['first_name', 'city_name', 'score_ID'], dtype='object')